// Дорожная карта становления программистом-разработчиком
class Подготовительный_этап_до_начала_обучения {
	class Сформировать_цель_обучения {};
	class Понять_что_мотивирует_изучать_программирование {};
	class Нужна_ли_математика {
		class Нужна_уровня_7_класса_обычной_школы {
			class Возведение_в_степень {};
			class Абсолютное_значение_числа_модуль {};
			class Извлечение_квадратного_корня {};
			class Умение_решать_математические_задачи {};
		};
		// ссылка на видео по этой теме
	};
	class C_какого_языка_начать {};
	class Дорожная_карта {};
	class Как_и_где_искать_материалы {};
	class Сколько_времени_требуется_на_учёбу {};
	class Что_нужно_чтобы_начать_учиться {};
	class Ошибки_при_обучении {
		class Теоретический_подход {};
		class Отношение_как_к_курсам_комп_граммотности {};
		class Хочется_быстро {};
		class Ради_денег {};
		class Распыление_сил_хочется_взяться_за_всё_сразу {};
	};
	class Форматы_обучения {
		class Теоретический_подход {};
		class Отношение {};
		class Теоретический_подход {};
		class Теоретический_подход {};
	};
};
class Базовый_уровень {
	class Для_чего {
		class Развитие_алгоритмического_мышления {};
		class Изучение_конструкций_языка {};
		class Решение_простых_задач {};
		class Понять_моё_или_не_моё {};
	};
	class Темы {
		class Вывод {};
		class Переменные {};
		class Условия {};
		class Циклы {
			class While {};
			class Числовые_ряды {};
			class DoWhile {};
			class For {};
		};
		class Массивы {};
		class Строки {};
		class Структуры {};
		class Файлы {};
	};
	class Критерии_освоения_этого_уровня {};
};
class Продвинутый_уровень {
	class Относительно_большие_программы {
		class Зачем {};
		class Пятнашки {};
		class Сапёр {};
		class Линии {};
		class Морской_бой {};
	};
	class Стек_Очередь {};
	class ООП {};
	class Указатели {};
	class Контейнеры {};
};
class Специализация {
	class Советы_по_выбору {
		class Выбрать_любое_направление {};
		class Выбрать_направление_которое_интересно {};
	};
	class Популярные_направления {
		class Базы_данных {};
		class Тестирование {};
		class Анализ_данных {};
		class Машинное_обучение_и_ИИ {};
		class Web_разработка {
			class Frontend {};
			class Backend {};
			class Fullstack {};
		};
		class Научные_исследования {};
		class Чат_боты {};
		class Встроенные_системы {};
		class Образование {};
		class Кибербезопасность {};
		class Разработка_языков_программирования {};
		class Игроделание {};
		class Торговые_роботы {};
		class Блокчейн_тегнологии {};
		class Менеджмент {};
		class Архитектура {};
	};
};
class Работа_с_реальным_проектом {
	class OpenSource {};
	class PetProject {};
	class Стажировка {};
	class Работа_в_найме {};
};

int main() {}