// Дорожная карта становления программистом-разработчиком
class Подготовительный_этап_до_начала_обучения {
	class Сформировать_цель_обучения {};
	class Что_мотивирует_изучать_программирование {};
	class Частые_вопросы {
		class Нужна_ли_математика {
			class Нужна_уровня_7_класса_обычной_школы {
				class Возведение_в_степень {};
				class Абсолютное_значение_числа_модуль {};
				class Извлечение_квадратного_корня {};
				class Умение_решать_математические_задачи {};
			};
			// ссылка на видео по этой теме
		};
		class C_какого_языка_начать {
			class Варианты {
				class Python {};
				class Си_плюс_плюс {};
				class Си {};
				class Java {};
				class JavaScript {};
				class Си_шарп {};
			};
		};
		class Как_и_где_искать_материалы {};
		class Сколько_времени_требуется_на_учёбу {};
		class Что_нужно_чтобы_начать_учиться {};
		class Где_лучше_учится {};
	};
	class Форматы_обучения {
		class Самостоятельно {};
		class Обучение_в_паре {};
		class Репетитор_ментор_наставник {};
		class Онлайн_курсы {};
		class ВУЗ_техникум {};
	};
	class Ошибки_при_обучении {
		class Теоретический_подход {};
		class Отношение_как_к_курсам_компьютерной_граммотности {};
		class Хочется_быстро_за_год_а_лучше_за_полгода {};
		class Ради_денег {};
		class Хочется_взяться_за_всё_сразу_за_все_языки_и_все_области {};
	};
};
class Базовый_уровень {
	class Цели_этого_уровня {
		class Развитие_алгоритмического_мышления {};
		class Изучение_конструкций_языка_и_синтаксиса {};
		class Изучение_базовых_алгоритмов {};
		class Решение_небольших_задач_до_50_строк_кода {};
		class Понять_программирование_это_моё_или_не_моё {};
	};
	class Темы {
		class Вывод {};
		class Переменные {};
		class Условия {};
		class Циклы {
			class While {};
			class Числовые_ряды {};
			class DoWhile {};
			class For {};
		};
		class Массивы {};
		class Вложенные_циклы {};
		class Функции_и_функциональное_программирование{};
		class Строки {};
		class Структуры {};
		class Вектор {};
		class Файлы {};
	};
	class Базовые_алгоритмы {
		class Обмен_значений {};
		class Сдвиг {};
		class Линейный_поиск {};
		class Поиск_подстроки {};
		class Поиск_максимума_минимума {};
		class Сортировка {};
	};
	class Доп {
		class Инструменты_для_програмирования {};
		class Пошаговая_отладка {};
		class Тестирование {
			class Ручное_тестирование {};
			class Unit_тесты {};
		};
		class Оптимизация_кода {};
		class Правила_оформления_кода {};
		class Структуризация_кода {};
		class Рефакторинг {};
		class Принцип_единственной_ответсвенности {
			//SRP - single-responsibility principle
		};
		class Принцип_простоты {
			// KISS - Keep It Simple, Stupid
		};
		class Принцип_без_повторов {
			// DRY - Don’t Repeat Yourself
		};
	};
	class Критерии_освоения_этого_уровня {};
};
class Продвинутый_уровень {
	class Освоение_сложных_алгоритмов {
		// Примеры таких алгоритмов
		class Заливка_области_заданным_цветом {};
		class Поиск_кратчайшего_пути {};
		class Обход_дерева_в_ширину_глубину {};
	};
	class Написание_относительно_больших_программы {
		class Зачем {};
		class Пятнашки {};
		class Сапёр {};
		class Линии {};
		class Морской_бой {};
	};
	class Изучение_продвинутых_структур_данных_контейнеров {
		class Стек {};
		class Очередь {};
		class Список {};
		class Множество {};
		class Пара {};
		class Словарь {};
		class Хеш_таблица {};
		class Понимание_когда_какой_контейнер_применяется {};
	};
	class Изучение_парадигм_программирования {
		class Функциональное_программирование {};
		class Объектно_ориентированное_программирование {};
	};
	class Указатели_и_динамическа_память {};
	class Итераторы {};
	class Обработка_ошибок {};
	class Шаблоны_паттерны_проектирования_ПО {};
	class Оценка_сложности_алгоритмов {};
	class Декораторы {};
	class Многопоточное_программирование {};
	class Архитектура_ПО {};
	class Критерии_освоения_этого_уровня {};
};
class Специализация {
	class Работа_чужим_кодом {};
	class Git_система_контроля_версий {};
	class Как_выбрать_направление_область {
		class Выбрать_любое_направление {};
		class Выбрать_направление_которое_интересно {};
	};
	class Популярные_направления {
		class Базы_данных {};
		class Машинное_обучение_ИИ {};
		class Анализ_данных {};
		class Тестирование {};
		class Web_разработка {
			class Frontend {};
			class Backend {};
			class Fullstack {};
		};
		class Научные_исследования {};
		class Сетевое_программирование {};
		class Чат_боты {};
		class Встроенные_системы {};
		class Образование {};
		class Кибербезопасность {};
		class Разработка_языков_программирования {};
		class Операционные_системы {};
		class Архитектур_ПО {};
		class Менеджмент {};
		class Игроделание {};
		class Блокчейн_тегнологии {};
		class Торговые_роботы {};
	};
	class Виды_специализации_широкая_узкая {};
	class Разработка_программного_обеспечения_с_использованием_фреймворков {};
	class Какое_направление_наиболее_популярное {};
	class Программное_администрирование {};
	class Участие_в_проектной_разработке_с_командой {};
	class Критерии_освоения_этого_уровня {};
};
class Работа_с_реальным_проектом {
	class Как_выбрать_проект {};
	class OpenSource {};
	class PetProject {};
	class Работа_в_найме {
		class Резюме {};
		class Собеседование {};
		class Стажировка {};
	};
};
