// Дорожная карта становления программистом-разработчиком
class Подготовительный_этап_до_начала_обучения {
	// Что_нужно_чтобы_начать_учиться
	class Сформулировать_для_себя_зачем_для_чего_хочу_учиться {
		class Интерес_к_технологиям {};
		class Создание_собственных_проектов {};
		class Творческое_самовыражение {};
		class Возможности_для_удаленной_работы {};
		class Смена_деятельности {};
		class Высокий_спрос_на_специалистов {};
		class Высокая_зарплата {};
	};
	class Примерно_представить_чем_занимаются_программисты {
		class Разработка_программного_обеспечения {};
		class Оптимизация_и_улучшение_существующих_программ {};
		class Тестирование_и_отладка {};
		class Проектирование_архитектуры {};
		class Интеграция_и_развертывание {};
		class Поддержка_и_обновление {};
		class Безопасность {};
		class Обучение_и_саморазвитие {};
	};
	class Выбрать_язык {
		class C_какого_языка_начать {};
		class На_что_ориентироваться_при_выборе {};
		class Варианты {
			class Python {};
			class Си_плюс_плюс {};
			class Си {};
			class Java {};
			class JavaScript {};
			class Си_шарп {};
		};
	};
	class Выбрать_форму_обучения {
		class Где_лучше_учится {};
		class Самостоятельно {};
		class Обучение_в_паре {};
		class Репетитор_ментор_наставник {};
		class Онлайн_курсы {};
		class ВУЗ_техникум {};
	};
	class Выбрать_обучающие_материалы {
		class Как_и_где_искать_материалы {};
	};
	class Частые_вопросы {
		class Длительность_обучения {};
		class Нужна_ли_математика {
			class Нужна_уровня_7_класса_обычной_школы {
				class Возведение_в_степень {};
				class Абсолютное_значение_числа_модуль {};
				class Извлечение_квадратного_корня {};
				class Умение_решать_математические_задачи {};
			};
			// ссылка на видео по этой теме
		};
	};
	class Форма_обучения {
	};
	class Ошибки_при_обучении {
		class Отношение_как_к_курсам_компьютерной_граммотности {};
		class Хочется_быстро_за_год_а_лучше_за_полгода {};
		class Ради_денег {};
		class Теоретический_подход {};
		class Хочется_взяться_за_всё_сразу_за_все_языки_и_все_области {};
	};
};
class Базовый_уровень {
	class Цели_этого_уровня {
		class Развитие_алгоритмического_мышления {};
		class Изучение_конструкций_языка_и_синтаксиса {};
		class Изучение_базовых_алгоритмов {};
		class Решение_небольших_задач_до_50_строк_кода {};
		class Понять_программирование_это_моё_или_не_моё {};
	};
	class Практика80процетов_теория20процентов {};
	class Где_взять_задачи {
		class JavaRush {
			//https://javarush.com/tasks		
		};
		class Edabit {
			// https://edabit.com/challenges
		};
		class Codewars {};
		class HackerRank {};
		class LeetCode {};
		class Задачники_по_программированию {
			class Златопольский {};
			class Абрамян {};
		};
	};
	class Темы {
		class ВводВывод {};
		class Переменные {};
		class Условия {};
		class Циклы {
			class While {};
			class Числовые_ряды {};
			class DoWhile {};
			class For {};
		};
		class Массивы {};
		class Вложенные_циклы {};
		class Функции_и_функциональное_программирование{};
		class Строки {};
		class Структуры {};
		class Вектор {};
		class Файлы {};
		class Базовые_алгоритмы {
			class Обмен_значений {};
			class Сдвиг_элементов_массиве {};
			class Линейный_поиск {};
			class Поиск_подстроки {};
			class Поиск_максимума_минимума {};
			class Сортировка {};
		};
	};
	class Доп {
		class Инструменты_для_програмирования {};
		class Пошаговая_отладка {};
		class Тестирование {
			class Ручное_тестирование {};
			class Unit_тесты {};
		};
		class Оптимизация_кода {};
		class Правила_оформления_кода {};
		class Структуризация_кода {};
		class Рефакторинг {};
		class Принцип_единственной_ответсвенности {
			//SRP - single-responsibility principle
		};
		class Принцип_простоты {
			// KISS - Keep It Simple, Stupid
		};
		class Принцип_без_повторов {
			// DRY - Don’t Repeat Yourself
		};
	};
	class Критерии_освоения_этого_уровня {};
};
class Продвинутый_уровень {
	class Освоение_продвинутых_алгоритмов {
		// Примеры таких алгоритмов
		class Заливка_области_заданным_цветом {};
		class Поиск_кратчайшего_пути {};
		class Обход_дерева_в_ширину_глубину {};
	};
	class Написание_относительно_больших_программы {
		class Зачем {};
		class Пятнашки {};
		class Сапёр {};
		class Линии {};
		class Морской_бой {};
	};
	class Изучение_продвинутых_структур_данных_контейнеров {
		class Стек {};
		class Очередь {};
		class Список {};
		class Дерево {};
		class Множество {};
		class Пара {};
		class Словарь {};
		class Хеш_таблица {};
		class Понимание_когда_какой_контейнер_применяется {};
	};
	class Изучение_парадигм_программирования {
		class Функциональное_программирование {};
		class Объектно_ориентированное_программирование {};
	};
	class Указатели_и_динамическа_память {};
	class Итераторы {};
	class Обработка_ошибок {};
	class Git_Github_система_контроля_версий {
		// Изучите, как работать с системами контроля версий, размещать свои проекты 
		// и участвовать в open - source.
	};
	class Шаблоны_паттерны_проектирования_ПО {};
	class Оценка_сложности_алгоритмов {};
	class Умение_гуглить {};
	class Декораторы {};
	class Многопоточное_программирование {};
	class Принципы_SOLID {};
	class Архитектура_ПО {};
	class Базы_данных {
		class Язык_SQL {};
		class СУБД {
			class PostgreSQL {};
			class MongoDB {};
			class Sqlite {};
			class MySQL {};
		};
	};
	class Критерии_освоения_этого_уровня {};
};
class Специализация {
	class Работа_чужим_кодом {};
	class Как_выбрать_направление_область {
		class Выбрать_любое_направление {};
		class Выбрать_направление_которое_интересно {};
	};
	class Популярные_направления {
		class Машинное_обучение_ИИ {};
		class Анализ_данных {};
		class Тестирование {};
		class Web_разработка {
			class Frontend {
				class Надо_изучить {
					// HTML, CSS, JavaScript, React / Vue / Angular.
				};
			};
			class Backend {
				class Надо_изучить {
					// Node.js, Django, Flask, Ruby on Rails
				};
			};
			class Fullstack {};
		};
		class Мобильная_разработка {
			// Kotlin / Java для Android или Swift для iOS.
		};
		class Научные_исследования {};
		class Десктоп_приложения{};
		class Сетевое_программирование {};
		class Чат_боты {};
		class Встроенные_системы {};
		class Компьютерная_графика {};
		class Игроделание {
			// Unity или Unreal Engine.
		};
		class Блокчейн_тегнологии {};
		class Образование {};
		class Кибербезопасность {};
		class Разработка_языков_программирования {};
		class Операционные_системы {};
		class Архитектур_ПО {};
		class Менеджмент {};
	};
	class Тестирование_для_выбранной_области {};
	class Виды_специализации_широкая_узкая {};
	class Разработка_программного_обеспечения_с_использованием_фреймворков {};
	class Какое_направление_наиболее_популярное {};
	class Программное_администрирование {};
	class Участие_в_проектной_разработке_с_командой {};
	class Критерии_освоения_этого_уровня {};
};
class Работа_с_реальным_проектом {
	class Как_выбрать_проект {};
	class OpenSource {};
	class PetProject {};
	class Работа_в_найме {
		class Портфолио {
			// Собирайте свои проекты в портфолио.Это может быть GitHub репозиторий, 
			// личный сайт или блог, где вы делитесь своими достижениями.
		};
		class Резюме {};
		class Собеседование {};
		class Стажировка {};
	};
};
